{
  "cur_pos": "1",
  "coins": 0,
  "items": [],
  "loc": {
    "1": {
      "text": "Вы играете за героя, который попал в опасный лес, вам нужно найти выход в город и остаться живым",
      "items": [],
      "next_move": {
        "Пойти вперед": "2"
      },
      "exchange": {}
    },
    "2": {
      "text": "Вы попали в лес и ощутили приятный аромат сосновых деревьев, который наполнил легкие. Похоже, что вы оказались в глубине дикой природы, где еще не ощущается шум городской суеты.",
      "items": [
        "фляга"
      ],
      "next_move": {
        "Пойти налево": "3",
        "Пойти прямо": "4",
        "Пойти направо": "5"
      },
      "exchange": {}
    },
    "3": {
      "text": "На покрытой землей каменной плите сидят темные фигуры, их глаза горят в темноте, а в руках у них ножи. Они улыбаются вам и произносят \"Добро пожаловать, Наш новый друг!\". Вам настолько не хватает еды и воды для того, чтобы идти дальше, что вы становитесь их жертвой и все заканчивается очень плохо.",
      "items": [],
      "next_move": {
        "Вы погибли. Начать сначала": "new_game"
      },
      "exchange": {}
    },
    "4": {
      "text": "Вы вышли в поле. Перед вам торговец.",
      "items": [],
      "next_move": {
        "Вернуть назад": "2"
      },
      "exchange": {
        "шкатулка": "золото: 3"
      }
    },
    "5": {
      "text": "Вы оказались около подземелья, которое смотрелось довольно страшно. ",
      "items": [
        "тапки"
      ],
      "next_move": {
        "Вернуться назад": "2",
        "Войти внутрь": "7",
        "Осмотреться вокруг": "6"
      },
      "exchange": {}
    },
    "6": {
      "text": "Осматриваясь вокруг, вы замечаете, что на стене рядом с входом кто-то нанес странные символы, которые вы не можете разгадать. Далее ты немного еще побродил с надеждой что-то найти...",
      "items": [
        "шкатулка"
      ],
      "next_move": {
        "Вернуться к подземелью": "5"
      },
      "exchange": {}
    },
    "7": {
      "text": "Стены здесь полностью закрыты грубым камнем, а в воздухе царит прохлада и сырость. Похоже, что вы находитесь на начальном уровне подземелья.",
      "items": [
        "золото: 2",
        "бутерброд"
      ],
      "next_move": {
        "Пойти вперед": "8",
        "Выйти на улицу": "5"
      },
      "exchange": {}
    },
    "8": {
      "text": "Ты проходишь дальше, тут очень темно и сыро. Но вдруг в далеке ты замечаешь свет",
      "items": [
        "тетрадь по алгебре"
      ],
      "next_move": {
        "Пойти дальше": "9",
        "Вернуться": "7"
      },
      "exchange": {}
    },
    "9": {
      "text": "Концовка не за горами, но прохождение не обойдется без дополнительных расходов. На выходе стоит разбойник с табличкой \"выход 5 золотых\"",
      "items": [],
      "next_move": {
        "Вернуться назад": "8"
      },
      "exchange": {
        "золото: 5": "выход"
      }
    }
  }
}