{
  "cur_pos": "9",
  "золото": 0,
  "items": [
    "перстень",
    "сапог",
    "кирка",
    "вход"
  ],
  "loc": {
    "1": {
      "text": "Вы играете за героя, который попал в опасный лес, вам нужно найти выход в город и остаться живым",
      "items": [],
      "next_move": {
        "Пойти вперед": "2"
      },
      "exchange": {}
    },
    "2": {
      "text": "Вы попали в лес и ощутили приятный аромат сосновых деревьев, который наполнил легкие. Похоже, что вы оказались в глубине дикой природы, где ещё не ощущается шум городской суеты.",
      "items": [
        "фляга"
      ],
      "next_move": {
        "Пройти налево": "3",
        "Пройти прямо": "4",
        "Пройти направо": "5"
      },
      "exchange": {}
    },
    "3": {
      "text": "В тёмном лесу, где деревья стояли плотной стеной, а земля была покрыта мхом, на путника напал отряд разбойников. Они были вооружены мечами и луками, их лица были скрыты капюшонами.\nПутник, заметив разбойников, попытался убежать, но они быстро настигли его. Один из разбойников схватил путника за руку и сорвал с пальца перстень.\nОднако, когда разбойник взглянул на перстень, его глаза расширились от удивления. На перстне была гравировка «Король». Разбойники, увидев эту надпись, испугались и отступили.\nПутник, воспользовавшись моментом, вырвался из их рук и побежал дальше в лес. Разбойники остались стоять на месте, не решаясь преследовать его.",
      "items": [],
      "next_move": {},
      "exchange": {
        "перстень": "выход"
      }
    },
    "4": {
      "text": "Вы вышли в поле. Перед вами торговец",
      "items": [],
      "next_move": {
        "Вернуться": "2"
      },
      "exchange": {}
    },
    "5": {
      "text": "Вы оказались около подземелья, которое смотрелось довольно страшно",
      "items": [],
      "next_move": {
        "Вернуться": "2",
        "Войти в подземелье": "7",
        "Осмотреться": "6"
      },
      "exchange": {}
    },
    "6": {
      "text": "Осматриваясь вокруг, вы замечаете, что на стене рядом с входом кто-то нанес странные символы, которые вы не можете разгадать. Далее ты немного ещё побродил с надеждой что-то найти...",
      "items": [],
      "next_move": {
        "Вернуться": "5"
      },
      "exchange": {}
    },
    "7": {
      "text": "Стены здесь полностью закрыты грубым камнем, а в воздухе царит прохлада и сырость. Похоже, что вы находитесь на начальном уровне подземелья.",
      "items": [],
      "next_move": {
        "Вернуться": "5",
        "Пойти дальше": "8"
      },
      "exchange": {}
    },
    "8": {
      "text": "Ты проходишь далльше, тут очень темно и сыро. Но вдруг в далеке ты замечаешь свет.",
      "items": [
        "тетрадь по алгебре"
      ],
      "next_move": {
        "Вернуться": "7",
        "Пройти дальше": "9"
      },
      "exchange": {}
    },
    "9": {
      "text": "Концовка не за горами, но прохождение не обойдется без дополнительных расходов. У выхода стоит разбойник с табличкой \"выход за 5 золотых\".",
      "items": [],
      "next_move": {},
      "exchange": {},
      "next_moove": {
        "Вернуться": "8",
        "Войти внутрь": "10"
      }
    },
    "10": {
      "text": "Хижина разбойников представляла собой простое строение из больших камней с хлипкой соломенной крышей. На крыше был знак с чёрными перекрещёнными костями в красном кругу. На столе в хижине разбойников стояла еда. Там были фрукты, овощи, мясо и хлеб. Также на столе можно было увидеть кувшины с водой и кружки.",
      "items": [
        "нож",
        "флаг воров",
        "хлеб"
      ],
      "next_move": {
        "Выйти из хижина в лес": "11"
      },
      "exchange": {}
    },
    "11": {
      "text": "Вы снова оказались в лесу, но уже полны сил. Вы видите знак \"Налево: дикая тропа\", \"Прямо: Избушка\", \"Направо: Разбойничий пир\"",
      "items": [],
      "next_move": {
        "Пойти налево": "12",
        "Пойти прямо": "13",
        "Пойти направо": "14"
      },
      "exchange": {}
    }
  }
}